       PROGRAM-ID. TYPEDEF-EXAMPLES.
       data division.
       WORKING-STORAGE SECTION.
       01 MY-TYPE TYPEDEF.
         05 MY-FIELD PIC X(5).
	   
         01 MY-VAR MY-TYPE VALUE "Hello".
	   
         01 MY-POINTER-TYPE POINTER TYPEDEF.
	   
         01 MY-POINTER-1 USAGE POINTER.
         01 MY-POINTER-2 MY-POINTER-TYPE.
	   
       PROCEDURE DIVISION.
           SET MY-POINTER-1 TO ADDRESS OF MY-VAR
           DISPLAY MY-POINTER-1
           SET MY-POINTER-2 TO ADDRESS OF MY-VAR
           DISPLAY MY-POINTER-2
